In [1]:
from sklearn.datasets import load_iris

from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()

from sklearn.preprocessing import MinMaxScaler
import numpy as np
import pandas as p
s=p.read_csv(r"D:\main.csv")

In [2]:
X, y = load_iris(return_X_y=True)
print(X.shape)

(150, 4)

In [3]:
scaler = MinMaxScaler()

In [4]:
scaler.fit(X)
# transform the test test
X_scaled = scaler.transform(X)

# Verify minimum value of all features
X_scaled.min(axis=0)

# array([0., 0., 0., 0.])
# Verify maximum value of all features
X_scaled.max(axis=0)

X_manual_scaled = (X-X.min(axis=0)) / (X.max(axis=0)-X.min(axis=0))


print(np.allclose(X_scaled, X_manual_scaled))

True

In [6]:
s.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator     5201
8        9   29      M        student     1002
9       10   53      M         lawyer    90703

In [9]:
columns=('occupation','min','max')

In [13]:
result=s.groupby('occupation').agg({'age':['min','max']})

In [14]:
print(result)

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60